<?php

$keyword = array(
);

function clearId($keyword)
{
  $special = array('Á', 'È', 'ô', 'Ç', 'á', 'è', 'Ò', 'ç', 'Â', 'Ë', 'ò', 'â', 'ë', 'Ø', 'Ñ', 'À', 'Ð', 'ø', 'ñ', 'à', 'ð', 'Õ', 'Å', 'õ', 'Ý', 'å', 'Í', 'Ö', 'ý', 'Ã', 'í', 'ö', 'ã', 'Î', 'Ä', 'î', 'Ú', 'ä', 'Ì', 'ú', 'Æ', 'ì', 'Û', 'æ', 'Ï', 'û', 'ï', 'Ù', '®', 'É', 'ù', '©', 'é', 'Ó', 'Ü', 'Þ', 'Ê', 'ó', 'ü', 'þ', 'ê', 'Ô', 'ß', ' ');
  $clearspc = array('a', 'e', 'o', 'c', 'a', 'e', 'o', 'c', 'a', 'e', 'o', 'a', 'e', 'o', 'n', 'a', 'd', 'o', 'n', 'a', 'o', 'o', 'a', 'o', 'y', 'a', 'i', 'o', 'y', 'a', 'i', 'o', 'a', 'i', 'a', 'i', 'u', 'a', 'i', 'u', 'a', 'i', 'u', 'a', 'i', 'u', 'i', 'u', '', 'e', 'u', 'c', 'e', 'o', 'u', 'p', 'e', 'o', 'u', 'b', 'e', 'o', 'b', '-');
  $newkeyword = str_replace($special, $clearspc, $keyword);
  return strtolower($newkeyword);
}

?>